In [1]:
import numpy as np
import pandas as pd

In [2]:
data = { 
    "names" : ["Anup","Aman","Vinay","Rohan",], 
    "marks" : [80,67,89,90],
    "native": ["Hebri","Mandarthi","Kundapura","Mangalore"]

}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   names  marks     native
0   Anup     80      Hebri
1   Aman     67  Mandarthi
2  Vinay     89  Kundapura
3  Rohan     90  Mangalore

In [5]:
df.to_csv('marks.csv')

In [6]:
df.to_csv('marks_indexless.csv',index=False)

In [7]:
df .head(2) # show first to rows

  names  marks     native
0  Anup     80      Hebri
1  Aman     67  Mandarthi

In [8]:
df.tail(2) # last two rows

   names  marks     native
2  Vinay     89  Kundapura
3  Rohan     90  Mangalore

In [9]:
df.describe()

           marks
count   4.000000
mean   81.500000
std    10.661457
min    67.000000
25%    76.750000
50%    84.500000
75%    89.250000
max    90.000000

In [10]:
emp = pd.read_csv('~/Documents/Python-Programs/Jupyter/pandas_tutorial/employees.csv') # abs path to file

In [11]:
emp

           Name               Email  Phone Number          Address
0     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
1    Mike Jones    mike@example.com  098-765-4321  321 Fake Avenue
2  Manya Shetty  manyas@example.com  020-998-7667     456 New York
3      Jane Doe    jane@example.com  112-345-6792  745 Park Avenue

In [12]:
print(type(emp))

<class 'pandas.core.frame.DataFrame'>

In [13]:
emp["Name"] # to get only name of all employees

0       Bob Smith
1      Mike Jones
2    Manya Shetty
3        Jane Doe
Name: Name, dtype: object

In [14]:
emp["Name"][1] # name at index 2

'Mike Jones'

In [23]:
# manipulating the data 

emp['Name'][3] = "Jhon Doe"
emp['Email'][3] = "jhon@example.com"
emp["Address"][1] = "New Avenue"
emp['Name'][1] = "Mary Jones"
emp["Email"][1] = "maryj@sample.com"

In [22]:
emp

           Name               Email  Phone Number          Address
0     Bob Smith     bob@example.com  123-456-7890  123 Fake Street
1    Mary Jones    maryj@sample.com  098-765-4321       New Avenue
2  Manya Shetty  manyas@example.com  020-998-7667     456 New York
3      Jhon Doe    jhon@example.com  112-345-6792  745 Park Avenue